Бухгалтерские_задачи_по_методичке/src/DataProcessors/ОбработкаДокументовПродажаТоваров/ОбработкаДокументовПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаДокументовПродажаТоваров</name>
</mdclass:DataProcessor>

Бухгалтерские_задачи_по_методичке/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_по_методичке/src/DataProcessors/ОбработкаДокументовПродажаТоваров/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСубконто(Команда)
	ЗаполнитьСубконтоНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСубконтоНаСервере()

	//Как в методичке работать правильно не будет!!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроводкиОборотыДтКт.Регистратор КАК Регистратор,
	|	ПроводкиОборотыДтКт.НомерСтроки,
	|	ПроводкиОборотыДтКт.СубконтоКт1 КАК Товар
	|ИЗ
	|	РегистрБухгалтерии.Проводки.ОборотыДтКт(,, Запись, СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Капитал),,
	|		СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),,) КАК ПроводкиОборотыДтКт
	|ИТОГИ
	|ПО
	|	Регистратор";

	РезультатЗапроса = Запрос.Выполнить();

	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);

	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока (ВыборкаРегистратор.Следующий() = Истина) Цикл

		ДокументСсылка = ВыборкаРегистратор.Регистратор;

		Проводки = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
		Проводки.Отбор.Регистратор.Установить(ДокументСсылка);

		Проводки.Прочитать();

		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			Проводка = Проводки.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			Если (Проводка.СчетДт = ПланыСчетов.Бухгалтерский.Капитал И Проводка.СчетКт
				= ПланыСчетов.Бухгалтерский.Товары) Тогда

				Проводка.СубконтоДт.Номенклатура = ВыборкаДетальныеЗаписи.Товар;

			КонецЕсли;

			Если (Проводка.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели И Проводка.СчетКт
				= ПланыСчетов.Бухгалтерский.Капитал) Тогда

				Проводка.СубконтоКт.Номенклатура = ВыборкаДетальныеЗаписи.Товар;

			КонецЕсли;
		КонецЦикла;
//		Если (Проводки.Модифицированность() = Истина) Тогда
		Проводки.Записать();
//		КонецЕсли;
	КонецЦикла;
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);

КонецПроцедуры
